# CheckerColor1 Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Checker..::..CheckerColor1 Property
Checker Class See Also
---
The property labeled "Color 1" from the "Checker" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string CheckerColor1 { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CheckerColor1 As String
	Get
```

Visual C++
---
```text
public:
static property String^ CheckerColor1 {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.
# See Also
Checker Class
Autodesk.Revit.DB.Visual Namespace